# Taps
tap "nikitabobko/tap"
tap "felixkratz/formulae"

# Window management
cask "nikitabobko/tap/aerospace"
brew "felixkratz/formulae/borders"

# Input remapping (Caps Lock → Hyper / Escape)
cask "karabiner-elements"

# Terminals
cask "ghostty"

# Fonts
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"  # patched z ikonkami (Ghostty, lualine, starship)

# Shell tools
brew "stow"
brew "ripgrep"
brew "lazygit"
brew "wget"
brew "jq"                          # JSON CLI processor
brew "gh"                          # GitHub CLI
brew "git-lfs"                     # large file storage for git

# Editor
brew "neovim"

# Modern CLI replacements + productivity
brew "starship"                    # prompt z git indicators
brew "fzf"                         # fuzzy finder (Ctrl+R, Ctrl+T)
brew "eza"                         # modern ls z ikonkami + --git
brew "bat"                         # cat z syntax highlighting
brew "git-delta"                   # pretty git diff
brew "zoxide"                      # smart cd (z foo)
brew "zsh-autosuggestions"         # fish-style suggestions
brew "zsh-syntax-highlighting"     # live command coloring

# Languages / runtime managers
brew "nvm"                         # Node version manager
brew "pnpm"                        # Node package manager
brew "python@3.12"
brew "python@3.11"
brew "python@3.10"
brew "python@3.9"

# Tmux
brew "tmuxinator"

# Misc
brew "btop"                        # system monitor (gotop replacement — gotop is unmaintained)
brew "slides"
brew "libmagic"                    # file type detection (dep used by some CLI tools)
