# Taps
tap "nikitabobko/tap"
tap "felixkratz/formulae"

# Window management
cask "nikitabobko/tap/aerospace"
brew "felixkratz/formulae/borders"

# Input remapping (Caps Lock → Hyper / Escape)
cask "karabiner-elements"

# Terminals
cask "ghostty"
cask "kitty"

# Fonts
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"  # patched z ikonkami (Ghostty, lualine, starship)

# Shell tools
brew "stow"
brew "ripgrep"
brew "lazygit"
brew "wget"

# Modern CLI replacements + productivity
brew "starship"                    # prompt z git indicators
brew "fzf"                         # fuzzy finder (Ctrl+R, Ctrl+T)
brew "eza"                         # modern ls z ikonkami + --git
brew "bat"                         # cat z syntax highlighting
brew "git-delta"                   # pretty git diff
brew "zoxide"                      # smart cd (z foo)
brew "zsh-autosuggestions"         # fish-style suggestions
brew "zsh-syntax-highlighting"     # live command coloring

# Tmux
brew "tmuxinator"

# Misc
brew "gotop"
brew "slides"
